ATsupportum/src/Catalogs/ЭкземплярыПродуктов_ат/ЭкземплярыПродуктов_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭкземплярыПродуктов_ат</name>
  <owners>Catalog.ПоставкиПродуктов_ат</owners>
  <attributes>
    <name>КлиентАрендатор</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольСервераРазмещения</name>
    <type>
      <types>CatalogRef.РолиСерверов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверРазмещения</name>
    <type>
      <types>CatalogRef.Серверы_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииПродуктов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПродукт</name>
    <type>
      <types>CatalogRef.Продукты_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КомментарийВнутренний</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскийЭП</name>
    <comment>//!!!!!HOTFIX</comment>
    <type>
      <types>CatalogRef.ЭкземплярыПродуктов_ат</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРодительскогоЭП</name>
    <comment>//!!!!!HOTFIX</comment>
    <type>
      <types>EnumRef.ТипыРодительскогоЭП_ат</types>
    </type>
  </attributes>
</mdclass:Catalog>

ATsupportum/src/Catalogs/ЭкземплярыПродуктов_ат/ManagerModule.bsl
#Область ОбработчикиСтандартныхСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ТекущийПродукт");
	Поля.Добавить("ТекущаяВерсия");
	//Поля.Добавить("РольСервераРазмещения");
	//Поля.Добавить("СерверРазмещения");
	Поля.Добавить("Описание");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПредСтрока = Данные.Наименование + ?(ЗначениеЗаполнено(Данные.Описание), " - " + Данные.Описание, "");
	
	ДобавленаСкобка = Ложь;
	
	Если СтрНайти(ВРег(Строка(Данные.ТекущийПродукт)), ВРег(Данные.Наименование)) = 0
		 И СтрНайти(ВРег(Строка(Данные.ТекущийПродукт.НаименованиеПолное)), ВРег(Данные.Наименование)) = 0
		 И СтрНайти(ВРег(Данные.Наименование), ВРег(Строка(Данные.ТекущийПродукт))) = 0
		 И СтрНайти(ВРег(Данные.Наименование), ВРег(Строка(Данные.ТекущийПродукт.НаименованиеПолное))) = 0
		 Тогда
		
		ПредСтрока = ПредСтрока + " (" + Строка(Данные.ТекущийПродукт);
		
		ДобавленаСкобка = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ТекущаяВерсия) Тогда
		
		Если ДобавленаСкобка Тогда
			
			ПредСтрока = ПредСтрока + ", ";
			
		Иначе
			
			ПредСтрока = ПредСтрока + " ("; 
			
		КонецЕсли;
		
		ПредСтрока = ПредСтрока + Данные.ТекущаяВерсия + ")";
		
	Иначе
		
		Если ДобавленаСкобка Тогда
			
			ПредСтрока = ПредСтрока + ")";
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Данные.РольСервераРазмещения) Тогда
	//	
	//	ПредСтрока = ПредСтрока + " на " + Строка(Данные.РольСервераРазмещения)
	//	
	//ИначеЕсли ЗначениеЗаполнено(Данные.СерверРазмещения) Тогда
	//	
	//	ПредСтрока = ПредСтрока + " на " + Строка(Данные.СерверРазмещения)
	//	
	//КонецЕсли;
	
	Представление = ПредСтрока;
		
		//?(ЗначениеЗаполнено(Данные.РольСервераРазмещения.Наименование),
		//	Данные.РольСервераРазмещения.Наименование + " <" + Строка(Данные.СерверРазмещения) + ">",
		//	Строка(Данные.РольСервераРазмещения.ВидРолиСервера) + " <" + Строка(Данные.СерверРазмещения) + ">"),
		//?(ЗначениеЗаполнено(Данные.СерверРазмещения), "<" + Строка(Данные.СерверРазмещения) + ">", ""))
	
КонецПроцедуры

#КонецОбласти
